## 按那个axis,就是这个axis要动起来(类似被for遍历),其他的axis保持不动

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    np.arange(12).reshape(3,4),
    columns = ["A","B","C","D"]
)

In [3]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

## 1.单列drop,就是删除某一列

In [4]:
# 代表的就是删除某列

In [5]:
df.drop("A",axis=1)

   B   C   D
0  1   2   3
1  5   6   7
2  9  10  11

## 2.单行drop,就是删除某一行

In [6]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [7]:
# 代表的就是删除某一行
df.drop(1,axis=0)

   A  B   C   D
0  0  1   2   3
2  8  9  10  11

In [8]:
df.drop(0,axis=0)

   A  B   C   D
1  4  5   6   7
2  8  9  10  11

## 3.按axis=0/index 执行mean聚合操作
#### 反直觉:输出的不是每行的结果,而是每列的结果

In [9]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [10]:
# axis=0 or axis=index

In [11]:
df.mean(axis=0)

A    4.0
B    5.0
C    6.0
D    7.0
dtype: float64

In [16]:
df.mean(axis=1)

0    1.5
1    5.5
2    9.5
dtype: float64